doc/BUILD/source/_static/soap_outputs/6.2.314.3321/ask_manual_question_complex_query1_step_8_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <group>
            <and_flag>0</and_flag>
            <filters>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Windows.*</value>
                <ignore_case_flag>1</ignore_case_flag>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>45421433</hash>
                </sensor>
              </filter>
              <filter>
                <not_flag>1</not_flag>
                <value>.*Windows.*</value>
                <ignore_case_flag>1</ignore_case_flag>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>45421433</hash>
                </sensor>
              </filter>
            </filters>
          </group>
          <selects>
            <select>
              <filter>
                <sensor>
                  <hash>3409330187</hash>
                </sensor>
              </filter>
              <sensor>
                <hash>3409330187</hash>
              </sensor>
            </select>
            <select>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Shared.*</value>
                <max_age_seconds>3600</max_age_seconds>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>1374547302</hash>
                  <id>381</id>
                </sensor>
              </filter>
              <sensor>
                <source_id>381</source_id>
                <parameters>
                  <parameter>
                    <value>Program Files</value>
                    <key>||dirname||</key>
                  </parameter>
                  <parameter>
                    <value></value>
                    <key>||regexp||</key>
                  </parameter>
                  <parameter>
                    <value>No</value>
                    <key>||casesensitive||</key>
                  </parameter>
                  <parameter>
                    <value>No</value>
                    <key>||global||</key>
                  </parameter>
                  <parameter>
                    <value>Microsoft.*</value>
                    <key>||regex||</key>
                  </parameter>
                  <parameter>
                    <value>test</value>
                    <key>|| invalidparam||</key>
                  </parameter>
                </parameters>
              </sensor>
            </select>
          </selects>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>